# PathOfTravel Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathOfTravel Class
Members See Also
---
An element which holds a graphical representation of the shortest route between two points in the plane of a floor plan view. The shortest route is calculated to go around model geometry visible in the view. Route calculation is affected by properties of the RouteAnalysisSettings element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public class PathOfTravel : Element
```

Visual Basic
---
```text
Public Class PathOfTravel _
	Inherits Element
```

Visual C++
---
```text
public ref class PathOfTravel : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Analysis..::..PathOfTravel
# See Also
PathOfTravel Members
Autodesk.Revit.DB.Analysis Namespace